tutorials/combustion/fireFoam/les/smallPoolFire3D/constant/pyrolysisZones
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    pyrolysis
    {

        active          false;

        pyrolysisModel  none;

        regionName      panelRegion;

        reactingOneDimCoeffs
        {
            filmCoupled     false;

            radFluxName     Qr;

            minimumDelta    1e-8;

            moveMesh        false;
        }

        infoOutput      false;
    }
)

// ************************************************************************* //
